package com.test;

import java.util.HashMap;
import java.util.Map;

public class TmpCoreHelp {
public static void main(String[] args) {
	int cck=0;
	Map<String,String> ksmap=new HashMap<String, String>();
	ksmap.put("各岗位安全操作规程","各岗位安全操作规程");
	ksmap.put("安全生产例会制度","安全生产例会制度");
	ksmap.put("作业场所","危险作业, 场所设施, 生产作业");
	ksmap.put("安全生产检查及事故隐患排查制度","安全生产检查及事故隐患排查制度");
	ksmap.put("低压配电室（384V以下）","门窗的要求");
	ksmap.put("疏散通道、安全出口","疏散通道、安全出口");
	ksmap.put("低压配电室（386V以下）","劳动防护用品穿戴");
	ksmap.put("劳动防护用品配备和管理制度","劳动防护用品配备和管理制度");
	ksmap.put("作业场所防火、防毒、防爆管理制度","作业场所防火、防毒、防爆管理制度");
	ksmap.put("与承租单位、承包单位签订安全生产管理协议","与承租单位、承包单位签订安全生产管理协议");
	ksmap.put("危害告知","危害告知");
	ksmap.put("从业人员教育培训","从业人员教育培训");
	ksmap.put("供电系统","供电系统");
	ksmap.put("插座","使用要求, 接地、漏电保护装置");
	ksmap.put("“三违”行为","“三违”行为");
	ksmap.put("职业病防治计划及实施方案","职业病防治计划及实施方案");
	ksmap.put("特种作业人员持证上岗","特种作业人员持证上岗");
	ksmap.put("化学品安全技术说明书和安全标签","化学品安全技术说明书和安全标签");
	ksmap.put("危险化学品储存场所","设施, 储存");
	ksmap.put("其他保障安全生产的规章制度","其他保障安全生产的规章制度");
	ksmap.put("应急救援物资","应急救援物资");
	ksmap.put("职业卫生档案","职业卫生档案");
	ksmap.put("包装物和容器","包装物和容器");
	ksmap.put("危害因素检测报告","危害因素检测报告");
	ksmap.put("安全生产资金使用情况","安全生产资金使用情况");
	ksmap.put("应急照明","应急照明");
	ksmap.put("劳动防护用品配备和管理记录档案","劳动防护用品配备和管理记录档案");
	ksmap.put("各部门、各岗位职责","各部门、各岗位职责");
	ksmap.put("警示标志","警示标志");
	ksmap.put("低压配电室（381V以下）","挡板");
	ksmap.put("特种作业管理制度","特种作业管理制度");
	ksmap.put("维护保养","维护保养");
	ksmap.put("临时照明","手提式和局部照明灯具的安全保护措施, 行灯的安全保护措施");
	ksmap.put("其他机械","电焊机");
	ksmap.put("特种作业人员培训","特种作业人员培训");
	ksmap.put("配电箱、柜","金属框架接地, 漏电保护是否齐全、灵敏可靠、定期自检1, 漏电保护是否齐全、灵敏可靠、定期自检2, 漏电保护是否齐全、灵敏可靠、定期自检3, 配电箱、柜1米范围内不应有物品遮挡");
	ksmap.put("重大危险源管理制度","重大危险源管理制度");
	ksmap.put("特种设备","特种设备");
	ksmap.put("设备、化学品材料中文说明书","设备、化学品材料中文说明书");
	ksmap.put("安全生产教育培训记录","安全生产教育培训记录");
	ksmap.put("安全生产奖励和惩罚制度","安全生产奖励和惩罚制度");
	ksmap.put("手持电动工具、移动电气设备","定期检查, 电源导线及连接, 露天防护措施, 电源线、电源插头");
	ksmap.put("“三同时”安全管理制度","“三同时”安全管理制度");
	ksmap.put("库房管理制度","库房管理制度");
	ksmap.put("值班制度","值班制度");
	ksmap.put("警示标识","警示标识");
	ksmap.put("应急救援组织","应急救援组织");
	ksmap.put("安全生产奖惩记录档案","安全生产奖惩记录档案");
	ksmap.put("单位主要负责人","单位主要负责人");
	ksmap.put("事故管理记录档案","事故管理记录档案");
	ksmap.put("生产布局","生产布局");
	ksmap.put("生产经营单位主要负责人和安全管理人员教育培训","生产经营单位主要负责人和安全管理人员教育培训");
	ksmap.put("低压配电室（382V以下）","绝缘胶垫铺设");
	ksmap.put("工伤社会保险缴费记录","工伤社会保险缴费记录");
	ksmap.put("安全生产资金保障制度","安全生产资金保障制度");
	ksmap.put("安全生产许可证","安全生产许可证");
	ksmap.put("应急救援演练记录","应急救援演练记录");
	ksmap.put("生产安全事故报告和处理制度","生产安全事故报告和处理制度");
	ksmap.put("厂房和其他建筑物","与明火安全距离, 生产场所, 厂房布局, 架空电力线, 与民用建筑安全距离, 消防通道");
	ksmap.put("固定用电设备","接地保护");
	ksmap.put("用电安全管理制度","用电安全管理制度");
	ksmap.put("防雷、防静电安全管理制度","防雷、防静电安全管理制度");
	ksmap.put("设备设施的安全管理制度","设备设施的安全管理制度");
	ksmap.put("安全生产教育培训制度","安全生产教育培训制度");
	ksmap.put("应当设置安全生产管理机构或配备专职安全生产管理人员","应当设置安全生产管理机构或配备专职安全生产管理人员");
	ksmap.put("消防管理制度","消防管理制度");
	ksmap.put("防雷、防静电防护装置的可靠性","防雷、防静电防护装置的可靠性");
	ksmap.put("安全防护","安全防护");
	ksmap.put("危害申报","危害申报");
	ksmap.put("运输及装卸作业","运输及装卸作业");
	ksmap.put("职业卫生管理制度或操作规程","职业卫生管理制度或操作规程");
	ksmap.put("营业执照","营业执照");
	ksmap.put("安全检查及事故隐患排查记录","安全检查及事故隐患排查记录");
	ksmap.put("废弃物处置","废弃物处置");
	ksmap.put("低压配电室（383V以下）","持证上岗（低压证）");
	ksmap.put("安全生产会议记录档案","安全生产会议记录档案");
	ksmap.put("电气线路敷设","一般环境下布线");
	ksmap.put("个人防护用品佩戴","个人防护用品佩戴");
	ksmap.put("爆炸危险场所","场所布局, 电器设施, 机动车辆, 工艺装置");
	ksmap.put("临时用电","使用期限, 漏电保护装置, 线路敷设");
	ksmap.put("消防设施与器材","消防设施与器材1, 消防设施与器材2");
	ksmap.put("职业健康监护档案","职业健康监护档案");
	for (Map.Entry<String, String> entry : ksmap.entrySet()) {
		System.out.println("fieldnamelsitchinese.add(\""+"_"+entry.getKey()+"_"+String.format("%03d", cck)+"\");");
		String needfix=entry.getValue();
		String[] needfixs=needfix.split(",");
		for (int i = 0; i < needfixs.length; i++) {
			System.out.println("fieldnamelsitchinese.add(\""+needfixs[i].trim()+"_"+String.format("%03d", cck)+"\");");
		}
		cck++;
		
	}

	
}
}
