package com.test.pdf;

import com.wisdomregulation.data.entitybase.Base_Entity;
import com.wisdomregulation.data.entitybookjb.Entity_Book_2017_0;
import com.wisdomregulation.data.entitybookjb.Entity_Book_2017_29;
import com.wisdomregulation.data.entitybookjb.Entity_Book_2017_29_1;
import com.wisdomregulation.data.entitybookjb.Entity_Book_2017_45;
import com.wisdomregulation.pdflink.IPdfBack;
import com.wisdomregulation.shark.PdfFactoryJB;

public class PdfTestJB {
    public static void main(String[] args) {
        print37book2017();
    }

    private static void print37book2017() {
        final Base_Entity bookentity0 = new Entity_Book_2017_0()
                .put("案由","妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我哈哈哈哈哈哈哈几栋几零几离开")
                .put("案件来源","妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我")
                .put("案件发生时间","2018年10月18日")
                .put("案件名称","妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我哈哈哈哈哈哈发的发复健科了都没吃没地方卡的看健康路放大镜看了付款记录的房间啊发觉么么大昆仑山")
                .put("当事人","江苏省南京市浦口区华创路西研创园腾飞大厦南京安元科技有限公司")
                .put("当事人电话","18888888888")
                .put("法定代表人或负责人","李大哈")
                .put("当事人邮政编码","435000")
                .put("当事人地址","江苏省南京市建邺区集庆门大街永中街道江东门金鹰嘉园1单元3栋1111室")

                .put("案件基本情况","妈妈经常批评我做事不讲效率但我却是“意见接受行动照旧”。所以总不见我有什么事是成功的就拿这次的数算比赛来说吧比妈妈经常批评我做事不讲效率但我却是“ 意见接受行动照旧”。所以总不见我有什么事是成功的就拿这次的数算比赛来说吧比妈妈经常批评我做事不讲效率但我却是“意见接受行动照旧”。所以总不见我有什么事是成功的就拿这次的数算比赛来说吧比妈妈经常批评我做事不讲效率但我却是“意见接受行动照旧”。所以总不见我有什么事是成功的就拿这次的数算比赛来说吧比妈妈经常批评我做事不讲效率但我却是“意见接受行动照旧”。所以总不见我有什么事是成功的就拿这次的数算比赛来说吧比妈妈经常批评我做事不讲效率但我却是“意见接受行动照旧则又表现了父亲毅然将生计暂时搁置，执意为“我”送行的真切感情。则又表现了父亲毅然将生计暂时搁置，执意为“ 我”送行的真切感情。则又效率但我却是的房间咖啡敬爱的加法的就的房间拉克丝飞洒")
                .put("负责人意见","妈妈经常批评我做事不讲效率但我却是效率但我却是的房间咖啡敬爱的加法的覅就的房间拉克丝飞洒健康路发觉恐龙当家发奖励快点放假萨芬家里就妈妈经常批评我做事不讲效率但我 却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲")
                .put("承办人意见","写父亲为“我”送效率但我却是的房间咖啡敬爱的加法的覅就的房间拉克丝飞洒健康路发觉恐龙当家发奖励快点放假萨芬家里就效率但我却是的房间咖啡敬爱的加法的覅就的房间拉克丝飞洒健康路发觉恐龙当家发奖励快点放假萨芬家里就行的情景，重点描写父亲的背影，表现父子间的真挚感情。丧事完毕，因为父亲要到南京谋事，“我”也要回北京念书，所以父子便一路同行到了南京。到南京之后，因为父亲要谋事，须接交各种关系，忙是可以想见的。所以说定要一个熟识的茶房为“我”送行。“他再三嘱咐茶房，甚是仔细。”这既表现了父亲对“我”的关怀，同时也说明了他对茶房的不放心。父亲当时异地谋生，正须多方奔走，又难以抽身，因此，他“颇踌躇了一会”。“踌躇”，反映了在父亲心中谋事与送子的矛盾。而“终于决定还是自己送我去”，则又表现了父亲毅然将生计暂时搁置，执意为“我”送行的真切感情。则又表现了父亲毅然将生计暂时搁置，执意为“我”送行的真切感情。所以总不见我有什么事是成功的就拿这次的数算比赛来说吧比妈妈经常批评我做事不讲效率但我却是“意见接受行动照旧”。所以总不见我有什么事是成功的就拿这次的数算比赛来说吧比妈妈经常批评我做事不讲效率但我却是“意见接受行动照旧")
                .put("审核意见","妈妈经常批评我做事不讲效率但我却是“意见接受行动照旧”。所以总不见我有什么事是成功的就拿这次的数算比赛来说吧比")
                .put("审批意见","妈妈经常批评我做事不讲效率但我却是“意见接受行动照旧”。所以总不见我有什么事是成功的就拿这次的数算比赛来说吧比");
        final Base_Entity bookentity29 = new Entity_Book_2017_29()
                .put("案件名称","妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我哈哈哈哈哈哈发的发复健科了都没吃没地方卡的看健康路放大镜看了付款记录的房间啊发觉么么大昆仑山")
                .put("被处罚单位名称","南京安监局环保科办事处棣丰街道发放到村民考虑到飞机夹克都是这样的哦")
                .put("被处罚单位地址","江苏省南京市建邺区集庆门大街打发打发地方的东门啥东东减肥法家得福健康路")
                .put("法定代表人或负责人","李哈哈")
                .put("法定代表人职务","安监局主任思密达哦哦地方看看发动机哦")
                .put("法定代表人邮编","435000")
                .put("被处罚人","南京安监局环保科办事处棣丰街道发放到村民考虑到飞机夹克都是这样的哦")
                .put("被处罚人所在单位","南京安监局环保科办事处考打发打发绝地反击的房间啊虑到飞机夹克都是这样的哦")
                .put("被处罚人单位地址","江苏省南京市建邺区集庆门大街江东门13栋1111室地地道道的点点滴滴的")
                .put("被处罚人家庭住址","江苏省南京市建邺区集庆门大街绿地国际13栋一单元1111室地地道道的点点滴滴的")
                .put("被处罚人被处罚人联系电话","18888888888")

                .put("违法事实及处罚依据","妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是风大法兰克福的金卡的房价多少卡夫卡了大健康浪费时间看砥砺奋进克里斯多夫")
                .put("当事人的申辩意见","妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是的房间咖啡敬爱的加法的覅就的房间拉克丝飞洒健康路发觉恐龙当家发奖励快点放假萨芬家里就")
                .put("审核意见","妈妈经常批评我做事不讲效率但我却是“意见接受行动照旧”。所以总不见我有什么事是成功的就拿这次的数算比赛来说吧比")
                .put("负责人意见","妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是效率但我却是的房间咖啡敬爱的加法的覅就的房间拉克丝飞洒健康路发觉恐龙当家发奖励快点放假萨芬家里就效率但我却是的房间咖啡敬爱的加法的覅就的房间拉克丝飞洒健康路发觉恐龙当家发奖励快点放假萨芬家里就")
                .put("承办人意见","妈妈经常批评我做事不讲效率但我却是“意见接受行动照旧”。所以总不见我有什么事是成功的就拿这次的数算比赛来说吧比妈妈经常批评我做事不讲效率但我却是“ 意见接受行动照旧”。所以总不见我有什么事是成功的就拿这次的数算比赛来说吧比妈妈经常批评我做事不讲效率但我却是“意见接受行动照旧”。所以总不见我有什么事是成功的就拿这次的数算比赛来说吧比妈妈经常批评我做事不讲效率但我却是“意见接受行动照旧”。所以总不见我有什么事是成功的就拿这次的数算比赛来说吧比妈妈经常批评我做事不讲效率但我却是“意见接受行动照旧”。所以总不见我有什么事是成功的就拿这次的数算比赛来说吧比妈妈经常批评我做事不讲效率但我却是“意见接受行动照旧则又表现了父亲毅然将生计暂时搁置，执意为“我”送行的真切感情。则又表现了父亲毅然将生计暂时搁置，执意为“ 我”送行的真切感情。则又效率但我却是的房间咖啡敬爱的加法的就的房间拉克丝飞洒")
                .put("案件基本情况","妈妈经常批评我做事不讲效率但我却是“意见接受行动照旧”。所以总不见我有什么事是成功的就拿这次的数算比赛来说吧比妈妈经常批评我做事不讲效率但我却是“意见接受行动照旧”。所以总不见我有什么事是成功的就拿这次的数算比赛来说吧比妈妈经常批评我做事不讲效率但我却是“意见接受行动照旧”。所以总不见我有什么事是成功的就拿这次的数算比赛来说吧比妈妈经常批评我做事不讲效率但我却是“意见接受行动照旧”。所以总不见我有什么事是成功的就拿这次的数算比赛来说吧比")
                .put("审核意见","妈妈经常批评我做事不讲效率但我却是意见接受行动照旧所以总不见我有什么事是成功的就拿这次的数算比赛来说吧比")
                .put("审批意见","妈妈经常批评我做事不讲效率但我却是意见接受行动照旧所以总不见我有什么事是成功的就拿这次的数算比赛来说吧比");
        final Base_Entity bookentity29_1 = new Entity_Book_2017_29_1()
                .put("案件名称","妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我哈哈哈哈哈哈发的发复健科了都没吃没地方卡的看健康路放大镜看了付款记录的房间啊发觉么么大昆仑山")
                .put("被处罚单位名称","南京安监局环保科办事处棣丰街道发放到村民考虑到飞机夹克都是这样的哦")
                .put("被处罚单位地址","江苏省南京市建邺区集庆门大街打发打发地方的东门啥东东减肥法家得福健康路")
                .put("法定代表人或负责人","李哈哈")
                .put("法定代表人职务","安监局主任思密达哦哦地方看看发动机哦")
                .put("法定代表人邮编","435000")
                .put("被处罚人","南京安监局环保科办事处棣丰街道发放到村民考虑到飞机夹克都是这样的哦")
                .put("被处罚人所在单位","南京安监局环保科办事处考打发打发绝地反击的房间啊虑到飞机夹克都是这样的哦")
                .put("被处罚人单位地址","江苏省南京市建邺区集庆门大街江东门13栋1111室地地道道的点点滴滴的")
                .put("被处罚人家庭住址","江苏省南京市建邺区集庆门大街绿地国际13栋一单元1111室地地道道的点点滴滴的")
                .put("被处罚人被处罚人联系电话","18888888888")

                .put("案件调查情况及拟处理依据","妈妈经常批评我做事不讲效率妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是效率但我却是的房间咖啡敬爱的加法的覅就的房间拉克丝飞洒健康路发觉恐龙当家发奖励快点放假萨芬家里就")
                .put("审核意见","妈妈经常批评我做事不讲效率但我却是“意见接受行动照旧”。所以总不见我有什么事是成功的就拿这次的数算比赛来说吧比")
                .put("负责人意见","妈妈经常批评我做事不讲效率但我却是“意见接受行动照旧”。所以总不见我有什么事是成功的就拿这次的数算比赛来说吧比妈妈经常批评我做事不讲效率但我却是“ 意见接受行动照旧”。所以总不见我有什么事是成功的就拿这次的数算比赛来说吧比妈妈经常批评我做事不讲效率但我却是“意见接受行动照旧”。所以总不见我有什么事是成功的就拿这次的数算比赛来说吧比妈妈经常批评我做事不讲效率但我却是“意见接受行动照旧”。所以总不见我有什么事是成功的就拿这次的数算比赛来说吧比妈妈经常批评我做事不讲效率但我却是“意见接受行动照旧”。所以总不见我有什么事是成功的就拿这次的数算比赛来说吧比妈妈经常批评我做事不讲效率但我却是“意见接受行动照旧则又表现了父亲毅然将生计暂时搁置，执意为“我”送行的真切感情。则又表现了父亲毅然将生计暂时搁置，执意为“ 我”送行的真切感情。则又效率但我却是的房间咖啡敬爱的加法的就的房间拉克丝飞洒")
                .put("承办人意见","妈妈经常批评我做事不讲效率但我却是“意见接受行动照旧”。所以总不见我有什么事是成功的就拿这次的数算比赛来说吧比妈妈经常批评我做事不讲效率但我却是“ 意见接受行动照旧”。所以总不见我有什么事是成功的就拿这次的数算比赛来说吧比妈妈经常批评我做事不讲效率但我却是“意见接受行动照旧”。所以总不见我有什么事是成所以总不见我有什么事是成功的就拿这次的数算比赛来说吧比妈妈经常批评我做事不讲效率但我却是“意见接受行动照旧”。所以总不见我有什么事是成功的就拿这次的数算比赛来说吧比妈妈经常批评我做事不讲效率但我却是“意见接受行动照旧”。所以总不见我有什么事是成功的就拿这次的数算比赛来说吧比妈妈经常批评我做事不讲效率但我却是“意见接受行动照旧”。所以总不见我有什么事是成功的就拿这次的数算比赛来说吧比妈妈经常批评我做事不讲效率但我却是“意见接受行动照旧”。功的就拿这次的数算比赛来说吧比妈妈经常批评我做事不讲效率但我却是“意见接受行动照旧”。所以总不见我有什么事是成功的就拿这次的数算比赛来说吧比妈妈经常批评我做事不讲效率但我却是“意见接受行动照旧”。所以总不见我有什么事是成功的就拿这次的数算比赛来说吧比妈妈经常批评我做事不讲效率但我却是“意见接受行动照旧”。所以总不见我有什么事是成功的就拿这次的数算比赛来说吧比妈妈经常批评我做事不讲效率但我却是“意见接受行动照旧”。所以总不见我有什么事是成功的就拿这次的数算比赛来说吧比妈妈经常批评我做事不讲效率但我却是“意见接受行动照旧则又表现了父亲毅然将生计暂时搁置，执意为“我”送行的真切感情。则又表现了父亲毅然将生计暂时搁置，执意为“ 我”送行的真切感情。则又效率但我却是的房间咖啡敬爱的加法的就的房间拉克丝飞洒")
                .put("案件基本情况","妈妈经常批评我做事不讲效率但我却是“意见接受行动照旧”。所以总不见我有什么事是成功的就拿这次的数算比赛来说吧比妈妈经常批评我做事不讲效率但我却是“意见接受行动照旧”。所以总不见我有什么事是成功的就拿这次的数算比赛来说吧比妈妈经常批评我做事不讲效率但我却是“意见接受行动照旧”。所以总不见我有什么事是成功的就拿这次的数算比赛来说吧比妈妈经常批评我做事不讲效率但我却是“意见接受行动照旧”。所以总不见我有什么事是成功的就拿这次的数算比赛来说吧比")
                .put("审核意见","妈妈经常批评我做事不讲效率但我却是意见接受行动照旧所以总不见我有什么事是成功的就拿这次的数算比赛来说吧比")
                .put("审批意见","妈妈经常批评我做事不讲效率但我却是意见接受行动照旧所以总不见我有什么事是成功的就拿这次的数算比赛来说吧比");
        final Base_Entity bookentity45 = new Entity_Book_2017_45()
                .put("案件名称","妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我哈哈哈哈哈哈发的发复健科了都没吃没地方卡的看健康路放大镜看了付款记录的房间啊发觉么么大")
                .put("地址","江苏省南京市建邺区集庆门大街江东门啥东东减肥法家得福健康路打发打发大幅度发放打发打的房间开朗迪锋科技地方借口借口发")
                .put("职务","安监局主任思密达到付件放大镜看大富科技哦哦哦哈哈哈")
                .put("被处罚人（单位）","江苏省南京市建邺区集庆门大街江东门啥东东减肥法家得福多发发打的费大大放送健康路的地方对对对")
                .put("法定代表人","江苏省南京市浦口区华创路西研创园腾飞大厦南京安元科技有限公司")
                .put("所在单位","南京安监局环保科办事处考虑到飞机夹克打发打发哒哒哒哒都是这样的哦")
                .put("单位地址","江苏省南京市建邺区集庆门大街建邺万达广场8栋8单元8888室的方法会计法大幅度发放的接口")
                .put("家庭住址","江苏省南京市建邺区集庆门大街绿地国际13栋一单元1111室")

                .put("执行情况","妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是风大法兰克福的金卡的房价多少卡夫卡了大健康浪费时间看砥砺奋进克里斯多夫哈哈哈哈哈哈哈")
                .put("处理结果","妈妈经常批评我做事不讲效率妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是啦啦啦啦啦啦啦啦绿绿哈哈哈哈军或黄河大街覅偶饿哦解答借款方")
                .put("审核意见","妈妈经常批评我做事不讲效率但我却是“意见接受行动照旧”。所以总不见我有什么事是成功的就拿这次的数算比赛来说吧比")
                .put("负责人意见","妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是妈妈经常批评我做事不讲效率但我却是地方课哦我健康路接口附件肯德基恐龙当家而发达刻录机的覅哦啊的房间大幅健康路的接口浪费钱诶哦违法的军容积率科教科我开关机肉的防守打法是的发生呵呵呵呵呵")
                .put("承办人意见","写父亲为“我”送行的情景，重点描写父亲的背影，表现父子间的真挚感情。丧事完毕，因为父亲要到南京谋事，“我”也要回北京念书，所以父子便一路同行到了南京。到南京之后，因为父亲要谋事，须接交各种关系，忙是可以想见的。所以说定要一个熟识的茶房为“我”送行。“他再三嘱咐茶房，甚是仔细。”这既表现了父亲对“我”的关怀，同时也说明了他对茶房的不放心。父亲当时异地谋生，正须多方奔走，又难以抽身，因此，他“颇踌躇了一会”。“踌躇”，反映了在父亲心中谋事与送子的矛盾。而“终于决定还是自己送我去”，则又表现了父亲毅然将生计暂时搁置，执意为“我”送行的真切感情。“终予”二字，把父亲对“我”无限关切、过分忧虑的心理，表现得淋漓尽致。接下去写的便是车站送行的场面。进了车站以后，父亲“忙着照看行李”，“忙着向脚夫讲价钱”，“送我上车”，“给我拣定靠车门的一张椅子”，“嘱我路上小心”。父亲操劳忙碌的形象展现在面前。可“我”那时由于太年轻，对父亲尚不能完全理解，以至于还在“心里暗笑他的迂”。作者行文至此，一种近乎忏悔的感情不觉流注笔端——“唉，我现在想想，那时真是太聪明了！”自我责备之中，包含着深切的内疚与怀念。在车上坐定之后")
                .put("案件基本情况","妈妈经常批评我做事不讲效率但我却是“意见接受行动照旧”。所以总不见我有什么事是成功的就拿这次的数算比赛来说吧比妈妈经常批评我做事不讲效率但我却是“意见接受行动照旧”。所以总不见我有什么事是成功的就拿这次的数算比赛来说吧比妈妈经常批评我做事不讲效率但我却是“意见接受行动照旧”。所以总不见我有什么事是成功的就拿这次的数算比赛来说吧比妈妈经常批评我做事不讲效率但我却是“意见接受行动照旧”。所以总不见我有什么事是成功的就拿这次的数算比赛来说吧比")
                .put("审核意见","妈妈经常批评我做事不讲效率但我却是意见接受行动照旧所以总不见我有什么事是成功的就拿这次的数算比赛来说吧比")
                .put("审批意见","妈妈经常批评我做事不讲效率但我却是意见接受行动照旧所以总不见我有什么事是成功的就拿这次的数算比赛来说吧比");
        PdfFactoryJB.create().setFileout("testJB.pdf");
        PdfFactoryJB.create().setTTFpath("/Users/apple/安元");
        PdfFactoryJB.create().open();
        PdfFactoryJB.create().printerMaster(bookentity0);
        PdfFactoryJB.create().printerMaster(bookentity29);
        PdfFactoryJB.create().printerMaster(bookentity29_1);
        PdfFactoryJB.create().printerMaster(bookentity45);
        PdfFactoryJB.create().closeOnMainThread(new IPdfBack() {
            @Override
            public void writeError() {

            }

            @Override
            public void writeStart() {

            }

            @Override
            public void writeEnd() {
                System.out.println("printerOver");
            }
        });
    }
}
